{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"path":"/advanced/architecture","title":"Architecture"}}},{"node":{"frontmatter":{"path":"/advanced/contributing","title":"Contributing"}}},{"node":{"frontmatter":{"path":"/advanced/error-codes","title":"Error Codes"}}},{"node":{"frontmatter":{"path":"/advanced/lexicon","title":"Lexicon"}}},{"node":{"frontmatter":{"path":"/advanced/migration","title":"Migration"}}},{"node":{"frontmatter":{"path":"/advanced/peer-dependencies","title":"Peer Dependencies"}}},{"node":{"frontmatter":{"path":"/advanced/pnpify","title":"Pnpify"}}}]},"markdownRemark":{"html":"<h2 id=\"general-architecture\"><a href=\"#general-architecture\" aria-label=\"general architecture permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>General architecture</h2>\n<p>Yarn works through a core package (published as <code>@berry/core</code>) that exposes the various base components that make up a project. Some of components are classes that you might recognize from the API: <code>Configuration</code>, <code>Project</code>, <code>Workspace</code>, <code>Cache</code>, <code>Manifest</code>, and others. All those are provided by the core package.</p>\n<p>The core itself doesn't do much - it merely contains the logic required to manage a project. In order to use this logic from the command-line Yarn provides an indirection called <code>@berry/cli</code> which, interestingly, doesn't do much either. It however has two very important responsibilities: it hydrates a project instance based on the current directory (<code>cwd</code>), and inject the prebuilt Yarn plugins into the environment.</p>\n<p>See, Yarn is built in modular way that allow most of the business logic related to third-party interactions to be externalized inside their own package - for example the <a href=\"https://github.com/yarnpkg/berry/tree/master/packages/plugin-npm\">npm resolver</a> is but one plugin amongst many others. This design gives us a much simpler codebase to work with (hence an increased development speed and stabler product), and offers plugin authors the ability to write their own external logic without having to modify the Yarn codebase itself.</p>\n<h2 id=\"install-architecture\"><a href=\"#install-architecture\" aria-label=\"install architecture permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Install architecture</h2>\n<p>What happens when running <code>yarn install</code> can be summarized in a few different steps:</p>\n<ol>\n<li>\n<p>First we enter the \"resolution step\":</p>\n<ul>\n<li>\n<p>First we load the entries stored within the lockfile, then based on those data and the current state of the project (that it figures out by reading the manifest files, aka <code>package.json</code>) the core runs an internal algorithm to find out which entries are missing.</p>\n</li>\n<li>\n<p>For each of those missing entries, it queries the plugins using the <a href=\"https://github.com/yarnpkg/berry/blob/master/packages/berry-core/sources/Resolver.ts\"><code>Resolver</code></a> interface, and asks them whether they would know about a package that would match the given descriptor (<a href=\"https://github.com/yarnpkg/berry/blob/master/packages/berry-core/sources/Resolver.ts#L52\"><code>supportsDescriptor</code></a>) and its exact identity (<a href=\"https://github.com/yarnpkg/berry/blob/master/packages/berry-core/sources/Resolver.ts#L112\"><code>getCandidates</code></a>) and transitive dependency list (<a href=\"https://github.com/yarnpkg/berry/blob/master/packages/berry-core/sources/Resolver.ts#L121\"><code>resolve</code></a>).</p>\n</li>\n<li>\n<p>Once it has obtained a new list of package metadata, the core starts a new resolution pass on the transitive dependencies of the newly added packages. This will be repeated until it figures out that all packages from the dependency tree now have their metadata stored within the lockfile.</p>\n</li>\n<li>\n<p>Finally, once every package range from the dependency tree has been resolved into metadata, the core builds the tree in memory one last time in order to generate what we call \"virtual packages\". In short those virtual packages are split instances of a same base package - we use them to disambiguate all packages that list peer dependencies, whose dependency set would change depending on their location in the dependency tree (consult <a href=\"/berry/advanced/peer-dependencies\">this advanced article</a> for more information).</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Once the resolution is done, we enter the \"fetch step\":</p>\n<ul>\n<li>\n<p>Now that we have the exact set of packages that make up our dependency tree, we iterate over it and for each of them we start a new request to the cache to know whether the package if anywhere to be found. If it isn't we do just like we did in the previous step and we ask our plugins (through the <a href=\"https://github.com/yarnpkg/berry/blob/master/packages/berry-core/sources/Fetcher.ts\"><code>Fetcher</code></a> interface) whether they know about the package (<a href=\"https://github.com/yarnpkg/berry/blob/master/packages/berry-core/sources/Fetcher.ts#L43\"><code>supports</code></a>) and if so to retrieve it from whatever its remote location is (<a href=\"https://github.com/yarnpkg/berry/blob/master/packages/berry-core/sources/Fetcher.ts#L67\"><code>fetch</code></a>).</p>\n</li>\n<li>\n<p>Interesting tidbit regarding the fetchers: they communicate with the core through an abstraction layer over <code>fs</code>. We do this so that our packages can come from many different sources - it can be from a zip archive for packages downloaded from a registry, or from an actual directory on the disk for <a href=\"\"><code>portal:</code></a> dependencies.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>And finally, once all the packages are ready for consumption, comes the \"link step\":</p>\n<ul>\n<li>\n<p>In order to work properly, the packages you use must be installed on the disk in some way. For example, in the case of a native Node application, your packages would have to be installed into a set of <code>node_modules</code> directories so that they could be located by the interpreter. That's what the linker is about. Through the <a href=\"https://github.com/yarnpkg/berry/blob/master/packages/berry-core/sources/Linker.ts\"><code>Linker</code></a> and <a href=\"https://github.com/yarnpkg/berry/blob/master/packages/berry-core/sources/Installer.ts\"><code>Installer</code></a> interfaces the Yarn core will communicate with the registered plugins to let them know about the packages listed in the dependency tree, and describe their relationships (for example it would tell them that <code>tapable</code> is a dependency of <code>webpack</code>). The plugins can then decide what to do of these information in whatever they see fit.</p>\n</li>\n<li>\n<p>Doing this means that new linkers can be created for other programming languages pretty easily - you just need to write your own logic regarding what should happen from the packages provided by Yarn. Want to generate an <code>__autoload.php</code>? Do it! Want to setup a Python virtual env? No problemo!</p>\n</li>\n<li>\n<p>Something else that's pretty cool is that the packages from within the dependency tree don't have to all be of the same type. Our plugin design allows instantiating multiple linkers simultaneously. Even better - the packages can depend on one another across linkers! You could have a JavaScript package depending on a Python package (which is technically the case of <code>node-gyp</code>, for example).</p>\n</li>\n</ul>\n</li>\n</ol>","frontmatter":{"path":"/advanced/architecture","title":"Architecture"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"category":"advanced"}}