{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"path":"/features/offline-cache","title":"Offline Cache"}}},{"node":{"frontmatter":{"path":"/features/pnp","title":"Plug'n'Play"}}},{"node":{"frontmatter":{"path":"/features/plugins","title":"Plugins"}}},{"node":{"frontmatter":{"path":"/features/protocols","title":"Protocols"}}},{"node":{"frontmatter":{"path":"/features/workspaces","title":"Workspaces"}}},{"node":{"frontmatter":{"path":"/features/zero-installs","title":"Zero-Installs"}}}]},"markdownRemark":{"html":"<p>The offline cache is a feature that allows Yarn to work just fine even if the network goes down for any reason - whether it's because your employer didn't pay the utility bill or because the place where are hosted your packages becomes unavailable. It also is entirely compatible with <a href=\"/features/zero-installs\">Zero-Installs</a> and doesn't store more than a single file for each package, making it suitable for being stored within a repository.</p>\n<p>The way it works is simple: each time a package is downloaded from a \"remote\" location (\"remote\" has a generic meaning in this context: <code>file:</code> dependencies' remote will be the filesystem, for example) a copy will be stored within the cache. The next time this package needs to be installed, Yarn will leverage this cache instead of the original source.</p>\n<h2>Disabling the cache</h2>\n<p>Because the offline cache is leveraged to power PnP (files are read directly from within the zip archives), the cache cannot be disabled. That being said, it's totally safe to remove it entirely if needed - it will simply be rebuilt the next time you run <code>yarn install</code>.</p>\n<h2>Cache integrity</h2>\n<p>Because the archive checksums are stored within the lockfile, any cache corruption will be detected at install-time and you'll be asked to resolve the problem - either by removing the corrupted file, or updating the checksum. The later isn't meant to be done except for advanced users in extremely specific cases.</p>","frontmatter":{"path":"/features/offline-cache","title":"Offline Cache"}}},"pageContext":{}}