{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"path":"/features/constraints","title":"Constraints"}}},{"node":{"frontmatter":{"path":"/features/offline-cache","title":"Offline Cache"}}},{"node":{"frontmatter":{"path":"/features/pnp","title":"Plug'n'Play"}}},{"node":{"frontmatter":{"path":"/features/plugins","title":"Plugins"}}},{"node":{"frontmatter":{"path":"/features/protocols","title":"Protocols"}}},{"node":{"frontmatter":{"path":"/features/workspaces","title":"Workspaces"}}},{"node":{"frontmatter":{"path":"/features/zero-installs","title":"Zero-Installs"}}}]},"markdownRemark":{"html":"<blockquote>\n<p><strong>Experimental</strong></p>\n<p>This feature is still incubating, and its exact API might change from a release to the next. It means it's the perfect time for you to get involved and let us hear your feedback!</p>\n</blockquote>\n<p>Constraints are a solution to a very basic need: I have a lot of <a href=\"/berry/features/workspaces\">workspaces</a>, and I need to make sure they use the same version of their dependencies. Or that they don't depend on a specific package. Or that they use a specific type of dependency. Anyway, you see the point: whatever is the exact logic, my goal is the same; I want to automatically enforce some kind of rule accross all my workspaces. That's exactly what constraints allow you to do.</p>\n<h2>Creating a constraint</h2>\n<p>Constraints are created by adding a <code>constraints.pro</code> file at the root of your project (repository). The <code>.pro</code> extension might leave you perplex: this is because constraints aren't written in JavaScript (!) but rather in Prolog, a fact-based rule engine. The goal of this section isn't to teach you Prolog (good tutorials already exist, such as <a href=\"https://learnxinyminutes.com/docs/prolog/\">Learn Prolog in Y Minutes</a>),\nbut rather to show you why we chose it and the value it brings.</p>\n<p>As we mentioned, Prolog is a fact-based engine. It starts with a list of <em>facts</em> that are always true, and a list of <em>predicates</em> that basically read as \"predicate <code>f(X)</code> is true if <code>u(X)</code> and <code>v(X)</code> are both true\". By computing for which values of <code>X</code> are <code>u(X)</code> and <code>v(X)</code> true, Prolog is able to automatically compute the list of values for which <code>f(X)</code> would be true. This is particularly useful for contraints, because it allows you to write very simple but powerful rules that have the ability to affect all your workspaces in very few lines.</p>\n<p>Going back to the constraint engine, the <em>facts</em> are the definitions created by the package manager (such as \"fact: the root workspace depends on Lodash\"), and the <em>predicates</em> are the set of rules that you want to enforce accross your project (check below for some recipes).</p>\n<h3>Query predicate</h3>\n<p>The following predicates provide information about the current state of your project and are meant to be used in the dependencies of your own rules (check the recipes for examples how to use them in practice). Note that the <code>/&#x3C;number></code> syntax listed at the end simply is the predicate arity (number of arguments it takes).</p>\n<h4><code>workspace/1</code></h4>\n<pre><code class=\"language-prolog\">workspace(\n  WorkspaceCwd\n).\n</code></pre>\n<p>True if the workspace described by the specified <code>WorkspaceCwd</code> exists.</p>\n<h4><code>workspace_ident/2</code></h4>\n<pre><code class=\"language-prolog\">workspace_ident(\n  WorkspaceCwd,\n  WorkspaceIdent\n).\n</code></pre>\n<p>True if the workspace described by the specified <code>WorkspaceCwd</code> exists and if it has the specified <code>WorkspaceIdent</code>.</p>\n<h4><code>workspace_version/2</code></h4>\n<pre><code class=\"language-prolog\">workspace_version(\n  WorkspaceCwd,\n  WorkspaceVersion\n).\n</code></pre>\n<p>True if the workspace described by the specified <code>WorkspacedCwd</code> exists and if it has the specified <code>WorkspaceVersion</code>.</p>\n<h4><code>workspace_has_dependency/3</code></h4>\n<pre><code class=\"language-prolog\">workspace_has_dependency(\n  WorkspaceCwd,\n  DependencyIdent,\n  DependencyRange\n).\n</code></pre>\n<p>True if the workspace described by the specified <code>WorkspaceCwd</code> depends on the dependency described by the specified <code>DependencyIdent</code> and <code>DependencyRange</code> combination.</p>\n<h3>Constraint predicates</h3>\n<p>The following predicates will affect the behavior of the <code>yarn constraints check</code> and <code>yarn constraints fix</code> commands.</p>\n<h4><code>gen_enforced_dependency_range/3</code></h4>\n<pre><code class=\"language-prolog\">gen_enforced_dependency_range(\n  WorkspaceCwd,\n  DependencyIdent,\n  DependencyRange\n).\n</code></pre>\n<p>The <code>gen_enforced_dependency_range</code> rule offers a neat way to inform the package manager that a specific workspace MUST either depend on a specific range of a specific dependency (if <code>DependencyRange</code> is non-null) or not depend at all on the dependency (if <code>DependencyRange</code> is null).</p>\n<ul>\n<li><strong>This predicate allows the package manager to autofix the problems.</strong></li>\n</ul>\n<h4><code>gen_invalid_dependency/3</code></h4>\n<pre><code class=\"language-prolog\">gen_invalid_dependency(\n  WorkspaceCwd,\n  DependencyIdent,\n  Reason\n).\n</code></pre>\n<p>The <code>gen_invalid_dependency</code> predicate is used to inform the package manager that a specific workspace cannot depend on its current version of the package defined by <code>DependencyIdent</code>, the <code>Reason</code> parameter being offered as a way to express why the dependency is invalid.</p>\n<p>Contrary to <code>gen_enforced_dependency_range</code>, <code>gen_invalid_dependency</code> doesn't allow the package manager to autofix the problem. This makes <code>gen_invalid_dependency</code> suitable in case where the right fix would be ambiguous, and where the intervention of a human operator would be required (for example when two workspaces depend on two different versions of a same package).</p>\n<ul>\n<li>The errors reported by this predicate <strong>cannot</strong> be auto-fixed</li>\n<li>The reason parameter can be any string of your liking</li>\n</ul>\n<h2>Constraint recipes</h2>\n<p>The following constraints are a good starting point to figure out how to write your own rules. If you build one that you think would be a good fit for this section, open a PR and we'll add them here!</p>\n<blockquote>\n<p><strong>Quick note about the Prolog syntax</strong></p>\n<p>Be aware that in prolog <code>X :- Y</code> basically means \"X is true for each Y that's true\". Similarly, know that UpperCamelCase names are variables that get \"replaced\" by every compatible value possible. Finally, the special variable name <code>_</code> simply discard the parameter value.</p>\n</blockquote>\n<h3>Prevent all workspaces from depending on a specific package</h3>\n<pre><code class=\"language-prolog\">gen_enforced_dependency_range(WorkspaceCwd, 'tslib', null) :-\n  workspace_has_dependency(WorkspaceCwd, 'tslib', _).\n</code></pre>\n<p>We define a rule that says that for each dependency of each workspace in our project, if this dependency name is <code>tslib</code>, then it exists a similar rule of the <code>gen_enforced_dependency_range</code> type that forbids the workspace from depending on <code>tslib</code>. This will cause the package manager to see that the rule isn't met, and autofix it when requested by removing the dependency from the workspace.</p>\n<h3>Prevent two workspaces from depending on conflicting versions of a same dependency</h3>\n<pre><code class=\"language-prolog\">gen_invalid_dependency(WorkspaceCwd, DependencyIdent, 'This dependency conflicts with another one from another workspace') :-\n  workspace_has_dependency(WorkspaceCwd, DependencyIdent, DependencyRange),\n  workspace_has_dependency(_, DependencyIdent, DependencyRange2),\n  DependencyRange \\= DependencyRange2.\n</code></pre>\n<p>We define a <code>gen_invalid_dependency</code> rule that is true for each dependency of each package (first <code>workspace_has_dependency</code>) if it also exists another dependency of another package (second <code>workspace_has_dependency</code>) that has the same name but a different range (<code>\\=</code> operator).</p>\n<h3>Force all workspace dependencies to be made explicit</h3>\n<pre><code class=\"language-prolog\">gen_enforced_dependency_range(WorkspaceCwd, DependencyIdent, 'workspace:*') :-\n  workspace(WorkspaceCwd),\n  workspace_has_dependency(WorkspaceCwd, DependencyIdent, _).\n</code></pre>\n<p>We define a <code>gen_enforced_dependency_range</code> that requires the dependency range <code>workspace:*</code> to be used if the dependency name is also the name of a valid workspace. The final <code>workspace_has_dependency</code> check is there to ensure that this rule is only applied on workspace that currently depend on the specified workspace in the first place (if it wasn't there, the rule would instead force all workspaces to depend on one another).</p>","frontmatter":{"path":"/features/constraints","title":"Constraints"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"category":"features"}}