{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"path":"/advanced/architecture","title":"Architecture"}}},{"node":{"frontmatter":{"path":"/advanced/contributing","title":"Contributing"}}},{"node":{"frontmatter":{"path":"/advanced/error-codes","title":"Error Codes"}}},{"node":{"frontmatter":{"path":"/advanced/lexicon","title":"Lexicon"}}},{"node":{"frontmatter":{"path":"/advanced/peer-dependencies","title":"Peer Dependencies"}}}]},"markdownRemark":{"html":"<!-- Note that all entries within this file must be alphabetically sorted -->\n<h3>Descriptor</h3>\n<p>A descriptor is a combination of a package name (for example <code>lodash</code>) and a package <abbr>range</abbr> (for example <code>^1.0.0</code>). Descriptors are used to identify a set of packages rather than one unique package.</p>\n<h3>Fetcher</h3>\n<p>Fetchers are the components tasked from extracting the full package data from a <abbr>reference</abbr>. For example, the npm fetcher would download the package tarballs from the npm registry.</p>\n<p>See also: <a href=\"/berry/advanced/architecture\">Architecture</a></p>\n<h3>Linker</h3>\n<p>Linkers are the components that consume both a dependency tree and a store of package data, and generate in return disk artifacts specific to the environment they target. For example, the <abbr>Plug'n'Play</abbr> linker generates a single <code>.pnp.js</code> file.</p>\n<p>See also: <a href=\"/berry/advanced/architecture\">Architecture</a></p>\n<h3>Locator</h3>\n<p>A locator is a combination of a package name (for example <code>lodash</code>) and a package <abbr>reference</abbr> (for example <code>1.2.3</code>). Locators are used to identify a single unique package (interestingly, all valid locators also are valid <abbr>descriptors</abbr>).</p>\n<h3>Manifest</h3>\n<p>A manifest is a <code>package.json</code> file.</p>\n<h3>Plugin</h3>\n<p>Plugins are a new concept introduced in Yarn 2+. Through the use of plugins Yarn can be extended and made even more powerful - whether it's through the addition of new <abbr>resolvers</abbr>, <abbr>fetchers</abbr>, or <abbr>linkers</abbr>.</p>\n<p>See also: <a href=\"/berry/features/plugins\">Plugins</a></p>\n<h3>Plug'n'Play</h3>\n<p>Plug'n'Play is an alternative installation strategy that, instead of generating the typical <code>node_modules</code> directories, generate one single file that is then injected into Node to let it know where to find the installed packages. Starting from the v2, Plug'n'Play became the default strategy for Javascript projects.</p>\n<p>See also: <a href=\"/berry/features/pnp\">Plug'n'Play</a></p>\n<h3>PnP</h3>\n<p>See Plug'n'Play</p>\n<h3>Project</h3>\n<p>The term project is used to encompass all the <abbr>worktrees</abbr> that belong to the same dependency tree.</p>\n<p>See also: <a href=\"/berry/features/workspaces\">Workspaces</a></p>\n<h3>Range</h3>\n<p>A range is a string that, when combined with a package name, can be used to select multiple versions of a single package. Ranges typically follow <abbr>semver</abbr>, but can use any of the supported Yarn protocols.</p>\n<p>See also: <a href=\"/berry/features/protocols\">Protocols</a></p>\n<h3>Reference</h3>\n<p>A reference is a string that, when combined with a package name, can be used to select one single version of a single package. References typically follow <abbr>semver</abbr>, but can use any of the supported Yarn protocols.</p>\n<p>See also: <a href=\"/berry/features/protocols\">Protocols</a></p>\n<h3>Resolver</h3>\n<p>Resolvers are the components tasked from converting <abbr>descriptors</abbr> into <abbr>locators</abbr>, and extracting the package <abbr>manifests</abbr> from the package <abbr>locators</abbr>. For example, the npm resolver would check what versions are available on the npm registry and return all the candidates that satisfy the <abbr>semver</abbr> requirements, then would query the npm registry to fetch the full metadata associated to the selected resolution.</p>\n<p>See also: <a href=\"/berry/advanced/architecture\">Architecture</a></p>\n<h3>Scope</h3>\n<p>Scopes are a term linked inherited from the npm registry; they are used to describe a set of packages that all belong to the same entity. For example, all the Yarn packages related to the v2 belong to the <code>berry</code> scope on the npm registry. Scopes are traditionally prefixed with the <code>@</code> symbol.</p>\n<h3>Yarn</h3>\n<p>Yarn is a command line tool used to manage programming environments. Written in Javascript, it is mostly used along with others Javascript projects, but has capabilities that make it suitable to be used in various situations.</p>\n<h3>Workspace</h3>\n<p>Generally speaking, workspaces are a Yarn features used to work on multiple projects stored within the same repository.</p>\n<p>In the context of Yarn's vocabulary, workspaces are packages that are of a single <abbr>project</abbr>.</p>\n<p>See also: <a href=\"/berry/features/workspaces\">Workspaces</a></p>\n<h3>Worktree</h3>\n<p>A worktree is a private workspace that adds new child workspaces to the current <abbr>project</abbr>.</p>\n<p>See also: <a href=\"/berry/features/workspaces\">Workspaces</a></p>\n<h3>Zero-Install</h3>\n<p>See also: <a href=\"/berry/features/zero-installs\">Zero-Install</a></p>","frontmatter":{"path":"/advanced/lexicon","title":"Lexicon"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"category":"advanced"}}