{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"path":"/advanced/architecture","title":"Architecture"}}},{"node":{"frontmatter":{"path":"/advanced/peer-dependencies","title":"Peer Dependencies"}}}]},"markdownRemark":{"html":"<h2>General architecture</h2>\n<p>Yarn works through a core package (published as <code>@berry/core</code>) that exposes the various base component that make up a project. Some classes that you might recognize: <code>Configuration</code>, <code>Project</code>, <code>Workspace</code>, <code>Cache</code>, <code>Manifest</code>, ... all come from the core package.</p>\n<p>In order to use the core from the command-line, an indirection layer exists. This layer is called <code>@berry/cli</code>, and it doesn't really do much - its main responsibility is to simply delegate the command-line invocations to an instance of <a href=\"https://github.com/arcanis/clipanion\"><code>clipanion</code></a>, the CLI framework we use in Yarn. It does something else very important, though: it loads the Yarn plugins.</p>\n<p>See, Yarn is built in such a way that most of the logic specific to an environment can be extracted inside its own package. It gives us a more decoupled codebase to work on, and gives you the ability to write your own logic without having to modify the Yarn codebase itself. We went pretty far with this design, and as of now plugins can do many things (check the dedicated page for more information). Even the <a href=\"\">npm registry logic</a> is just one of our plugins, even if shipped by default!</p>\n<h2>Install architecture</h2>\n<p>When running <code>yarn install</code>, what happens? It can be summarized in a few different steps:</p>\n<ul>\n<li>\n<p>First we enter the \"resolution step\":</p>\n<ul>\n<li>\n<p>We load the entries stored in the lockfile.</p>\n</li>\n<li>\n<p>Then the core executes an algorithm to find out which entries are missing. Again, this is implemented directly within the core (<code>@berry/core</code>) in a generic way. Plugins don't need to care about the specifics at this time.</p>\n</li>\n<li>\n<p>For each of those missing entries, it will query the plugins using the <a href=\"\"><code>Resolver</code></a> interface, and will ask then whether they know about a package that would match the given descriptor (<code>supportsDescriptor</code>) and, if it's the case, its exact identity (<code>getCandidates</code>) and transitive dependency list (<code>resolve</code>).</p>\n</li>\n<li>\n<p>And we do that again until the whole dependency tree is ready to move on to the next step.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>After resolution comes the \"fetch step\":</p>\n<ul>\n<li>\n<p>This one really isn't hard - we simply iterate over the list of packages that are part of the dependency tree and, for each of them, we check whether they are already on disk or not. If they aren't, we download them from their remote location and store them within our cache.</p>\n</li>\n<li>\n<p>Similar to how we ask the plugins for information regarding our dependency tree, we also ask them to fetch the packages from their remote location through the <a href=\"\"><code>Fetcher</code></a> interface.</p>\n</li>\n<li>\n<p>Interesting tidbit regarding the fetchers: they communicate with the core through an abstraction layer over <code>fs</code>. We do this so that our packages can come from many different sources - it can be from a zip archive for packages downloaded from a registry, or from an actual directory on the disk for <a href=\"\"><code>portal:</code></a> dependencies.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Then comes the \"link step\". That's when things start to get interesting:</p>\n<ul>\n<li>\n<p>In order to work properly, the packages you use must be installed on the disk in some way. For example, in the case of native Node, your packages would have to be installed into <code>node_modules</code> directories so that they can be located by the interpreter. That's what the linker is about. Through the <code>Linker</code> and <code>Installer</code> interfaces the Yarn core (still <code>@berry/core</code>) will communicate with the registered plugins to let them know about the packages listed in the dependency tree, and how they are related (for example telling it that <code>tapable</code> is a dependency of <code>webpack</code>).</p>\n</li>\n<li>\n<p>Doing this means that new linkers can be created for other programming languages pretty easily - you just need to write your own logic regarding what should happen from the packages provided by Yarn. Want to generate an <code>__autoload.php</code>? Do it! Want to setup a Python virtual env? No problemo!</p>\n</li>\n<li>\n<p>Something else that's pretty cool is that the packages from within the dependency tree don't have to all be of the same type. Our plugin design allows instantiating multiple linkers simultaneously. Even better - the packages can depend on one another across linkers! You could have a JavaScript package depending on a Python package (which is technically the case of <code>node-gyp</code>, for example).</p>\n</li>\n</ul>\n</li>\n</ul>","frontmatter":{"path":"/advanced/architecture","title":"Architecture"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"category":"advanced"}}