{"data":{"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"path":"/advanced/architecture","title":"Architecture"}}},{"node":{"frontmatter":{"path":"/advanced/contributing","title":"Contributing"}}},{"node":{"frontmatter":{"path":"/advanced/error-codes","title":"Error Codes"}}},{"node":{"frontmatter":{"path":"/advanced/lexicon","title":"Lexicon"}}},{"node":{"frontmatter":{"path":"/advanced/peer-dependencies","title":"Peer Dependencies"}}}]},"markdownRemark":{"html":"<p>Thanks for being here! Yarn gives a lot of importance to being a community project, and we rely on your help as much as you rely on ours. In order to help you help us we've invested in an infra and documentation that should make contributing to Yarn very easy. If you have any feedback on what we could improve, please open an issue to discuss it!</p>\n<h2>Building the bundle</h2>\n<p>The standard bundle is built using the following command from anywhere in the repository:</p>\n<pre><code>$> yarn build:cli\n</code></pre>\n<p>The standard bundle uses a predefined set of plugins defined in <a href=\"https://github.com/yarnpkg/berry/blob/master/packages/berry-cli/package.json#L43\"><code>packages/berry-cli/package.json</code></a>. If your PR aims to add a new plugin to the standard build you'll need to add it there (note that this decision should be left to core maintainers - please don't modify this settings yourself).</p>\n<p>For development purposes, you can build your plugin as part of your local bundle by using the <code>--plugin</code> option in the command line:</p>\n<pre><code>$> yarn build:cli --plugin @berry/typescript\n</code></pre>\n<h2>Testing your code</h2>\n<p>We currently have two testsuites, built for different purposes. The first one are unit tests and can be triggered by running the following command from anywhere within the repository:</p>\n<pre><code>$> yarn test:unit\n</code></pre>\n<p>Those unit tests can typically be found in the <code>packages/*/tests</code> directory.</p>\n<p>While various subcomponents are tested via unit tests (for example the portable shell library), Yarn itself isn't tested through unit tests - we instead rely on integration tests which are much closer from our users setup. Those tests can be triggered through the following command (again, from anywhere within the repository):</p>\n<pre><code>$> yarn test:integration\n</code></pre>\n<p>In both cases the underlying framework we use is Jest, which means that you can filter the tests you want to run by using the <code>-t</code> flag (or simply the file path):</p>\n<pre><code>$> yarn test:unit berry-shell\n$> yarn test:integration -t 'it should correctly install a single dependency that contains no sub-dependencies'\n</code></pre>\n<p>Don't forget that your PR will require all the tests to pass before being merged!</p>\n<h2>Formatting your code</h2>\n<p>Before submitting your code for review, please make sure your code is properly formatted by using the following command from anywhere within the repository:</p>\n<pre><code>$> yarn test:lint\n</code></pre>\n<p>We use ESLint to check this, so using the <code>--fix</code> flag will cause ESLint to attempt to automatically correct most errors that might be left in your code:</p>\n<pre><code>$> yarn test:lint --fix\n</code></pre>","frontmatter":{"path":"/advanced/contributing","title":"Contributing"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"category":"advanced"}}